foo/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "emal", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["emal", "test@gmail.com"], ["created_at", "2018-01-18 05:44:38.954821"], ["updated_at", "2018-01-18 05:44:38.954821"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "emal" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Jon"], ["emal", "Jon@gmail.com"], ["updated_at", "2018-02-07 01:06:28.196838"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)